protected/components/Settings.php

SELECT * FROM `tbl_setting`
---
	protected function createProperty()
	{
		$configrations = Setting::find()->all();