protected/modules/notification/widgets/NotificationWidget.php

    public function renderHtml()
    {
        $url = Url::toRoute([
            '/notification/notification/notify'
        ]);
        $url_home = Url::toRoute([
            '/notification/notification'
        ], true);

        $count = Notification::find()->where([
            'is_read' => Notification::IS_NOT_READ,
            'to_user_id' => \Yii::$app->user->id
        ])->count();
---
SELECT COUNT(*) FROM `tbl_notification` WHERE (`is_read`=0) AND (`to_user_id`=2)