protected/models/User.php

    public function sendVerificationMailtoUser()
    {
        $sub = "Welcome! You new account is ready " . \Yii::$app->params['company'];
        $to = $this->email;
        $message = \yii::$app->view->renderFile('@app/mail/verification.php', [
            'user' => $this
        ]);
        $admin = self::find()->where([
            'role_id' => self::ROLE_ADMIN
        ])->one();
---
SELECT * FROM `tbl_user` WHERE `role_id`=0

    public static function findIdentity($id)
    {
        return static::findOne([
            'id' => $id,
            'state_id' => [
                self::STATE_ACTIVE
            ]
        ]);
---
SELECT * FROM `tbl_user` WHERE (`id`=2) AND (`state_id`=1)